In [23]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [24]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [25]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [26]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [27]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [28]:
df

             A         B
G1 1 -1.328181 -0.123981
   2  1.101382  0.733228
   3  0.007895 -1.146564
G2 1  0.649774  1.344788
   2  0.608596 -0.514256
   3  3.251007  0.287193

In [29]:
df.index.names

FrozenList([None, None])

In [30]:
df.index.names = ['Group', 'Num']

In [31]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [33]:
df.loc['G1']

            A         B
Num
1   -1.328181 -0.123981
2    1.101382  0.733228
3    0.007895 -1.146564

In [36]:
df.loc['G1'].iloc[0]

A   -1.328181
B   -0.123981
Name: 1, dtype: float64

In [37]:
type(df.loc['G1'])

pandas.core.frame.DataFrame

In [38]:
df.loc['G1'].loc[1]

A   -1.328181
B   -0.123981
Name: 1, dtype: float64

In [39]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [46]:
df.iloc[0]

A   -1.328181
B   -0.123981
Name: (G1, 1), dtype: float64

In [47]:
df.iloc[5]

A    3.251007
B    0.287193
Name: (G2, 3), dtype: float64

In [48]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [52]:
df.loc['G2']['B'][2]

-0.51425634647284835

In [54]:
df.iloc[-2]['B']

-0.51425634647284835

In [55]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [57]:
df.xs('G1')

            A         B
Num
1   -1.328181 -0.123981
2    1.101382  0.733228
3    0.007895 -1.146564

In [58]:
df.xs(1, level = 'Num')

              A         B
Group
G1    -1.328181 -0.123981
G2     0.649774  1.344788

In [60]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [61]:
df['A']

Group  Num
G1     1     -1.328181
       2      1.101382
       3      0.007895
G2     1      0.649774
       2      0.608596
       3      3.251007
Name: A, dtype: float64

In [65]:
df.xs(3, level = 'Num')

              A         B
Group
G1     0.007895 -1.146564
G2     3.251007  0.287193

In [68]:
df.loc['G1'].loc[3]

A    0.007895
B   -1.146564
Name: 3, dtype: float64

In [67]:
df.loc['G2'].loc[3]

A    3.251007
B    0.287193
Name: 3, dtype: float64

In [69]:
df

                  A         B
Group Num
G1    1   -1.328181 -0.123981
      2    1.101382  0.733228
      3    0.007895 -1.146564
G2    1    0.649774  1.344788
      2    0.608596 -0.514256
      3    3.251007  0.287193

In [70]:
df.xs(1, level = 'Num')

              A         B
Group
G1    -1.328181 -0.123981
G2     0.649774  1.344788